# https://www.hub.go.kr/portal/opn/tyb/idx-bdrg-flr.do
# -> 하단 메타정보 조회 -> 구조코드

# 건물 구조 코드
class BuildingStructure:
    CHOICES = [
        ('10', '조적구조'),
        ('11', '벽돌구조'),
        ('12', '블록구조'),
        ('13', '석구조'),
        ('19', '기타조적구조'),
        ('20', '콘크리트구조'),
        ('21', '철근콘크리트구조'),
        ('22', '프리케스트콘크리트구조'),
        ('29', '기타콘크리트구조'),
        ('30', '철골구조'),
        ('31', '일반철골구조'),
        ('32', '경량철골구조'),
        ('33', '강파이프구조'),
        ('39', '기타강구조'),
        ('40', '철골철근콘크리트구조'),
        ('41', '철골콘크리트구조'),
        ('42', '철골철근콘크리트구조'),
        ('49', '기타철골철근콘크리트구조'),
        ('50', '목구조'),
        ('51', '일반목구조'),
        ('52', '통나무구조'),
        ('99', '기타구조')
    ]